app/Controllers/DataPenilaian.php

    public function index()
    {
        if (!session('id_login')) {
            return redirect()->to('/'); // Ganti '/login' dengan URL login Anda
        }
        $this->bidangModel = new BidangModel();

        $data['bidang'] = $this->bidangModel->findAll();
            //   var_dump(session('level'));exit;
        if (session('level')=='admin') {
            # code...
            $data['penilaian'] = $this->penilaianModel
                ->select('penilaian.*, karyawan.nama,karyawan.nik,nama_bidang')
                ->join('karyawan', 'karyawan.id_karyawan = penilaian.id_karyawan')
                ->join('bidang','bidang.id_bidang=karyawan.id_bidang')
                ->orderBy('bidang.id_bidang','DESC')
                // ->where('id_bidang',$id_bidang)
                ->findAll();
        }else{
            $id_login=session('id_login');
            $data = $this->karyawanModel
        //   ->join('bidang','bidang.id_bidang=karyawan.id_bidang')
            ->where('id_login', $id_login)->first();
            $id_bidang=$data['id_bidang'];
            $data['penilaian'] = $this->penilaianModel
                ->select('penilaian.*, karyawan.nama,karyawan.nik,nama_bidang')
                ->join('karyawan', 'karyawan.id_karyawan = penilaian.id_karyawan')
                ->join('bidang','bidang.id_bidang=karyawan.id_bidang')
                ->where('bidang.id_bidang',$id_bidang)
                ->orderBy('bidang.id_bidang','DESC')
                ->findAll();
---
SELECT *
FROM `bidang`
SELECT `penilaian`.*, `karyawan`.`nama`, `karyawan`.`nik`, `nama_bidang`
FROM `penilaian`
JOIN `karyawan` ON `karyawan`.`id_karyawan` = `penilaian`.`id_karyawan`
JOIN `bidang` ON `bidang`.`id_bidang`=`karyawan`.`id_bidang`
ORDER BY `bidang`.`id_bidang` DESC
SELECT `penilaian`.*, `karyawan`.`nama`, `karyawan`.`nik`, `nama_bidang`
FROM `penilaian`
JOIN `karyawan` ON `karyawan`.`id_karyawan` = `penilaian`.`id_karyawan`
JOIN `bidang` ON `bidang`.`id_bidang`=`karyawan`.`id_bidang`
WHERE `bidang`.`id_bidang` = '1'
ORDER BY `bidang`.`id_bidang` DESC

    public function tambah()
    {
        if (!session('id_login')) {
            return redirect()->to('/'); // Ganti '/login' dengan URL login Anda
        }
        $id_login=session('id_login');
      $data = $this->karyawanModel
    //   ->join('bidang','bidang.id_bidang=karyawan.id_bidang')
      ->where('id_login', $id_login)->first();
      $id_bidang=$data['id_bidang'];
        $data = [
            'karyawan' => $this->karyawanModel->where('id_bidang',$id_bidang)->findAll()
        ];
---
SELECT *
FROM `karyawan`
WHERE `id_bidang` = '1'