app/Controllers/Datakaryawan.php

SELECT `karyawan`.`id_karyawan`, `karyawan`.`nik`, `karyawan`.`nama`, `karyawan`.`jabatan`, `karyawan`.`tanggal_bekerja`, `karyawan`.`id_bidang`, `bidang`.`nama_bidang`
FROM `karyawan`
JOIN `bidang` ON `bidang`.`id_bidang` = `karyawan`.`id_bidang`
WHERE `bidang`.`id_bidang` = '1'
---
    public function index()
    {
        // var_dump(session('level'));exit;
        $id_login = session('id_login');
        $data = $this->karyawanModel
            //   ->join('bidang','bidang.id_bidang=karyawan.id_bidang')
            ->where('id_login', $id_login)->first();
        $id_bidang = $data['id_bidang'];
        //   var_dump($data['nama_bidang']);exit;
        $data['karyawan'] = $this->karyawanModel
            ->select('karyawan.id_karyawan,karyawan.nik, karyawan.nama, karyawan.jabatan, karyawan.tanggal_bekerja, karyawan.id_bidang, bidang.nama_bidang')
            ->join('bidang', 'bidang.id_bidang = karyawan.id_bidang')
            ->where('bidang.id_bidang', $id_bidang)
            ->findAll();

SELECT *
FROM `bidang`
WHERE `id_bidang` = '19'
---
    public function tambah()
    {
        // var_dump('a');exit;
        $id_login = session('id_login');
        $data = $this->karyawanModel
            //   ->join('bidang','bidang.id_bidang=karyawan.id_bidang')
            ->where('id_login', $id_login)->first();
        $id_bidang = $data['id_bidang'];
        $data = [
            'bidang' => $this->bidangModel->where('id_bidang', $id_bidang)->findAll(),
            'id_bidang' => $id_bidang
        ];