app/Models/SlipGajiModel.php

SELECT `t_hr_slip_gaji`.`id` as `slip_gaji_id`, `t_hr_slip_gaji`.*, `m_pegawai`.*, `m_jabatan`.*, MAX(t_hr_jasa_medis_detail.jm_amount) as jasa_medis
FROM `t_hr_slip_gaji`
JOIN `m_pegawai` ON `t_hr_slip_gaji`.`peg_code` = `m_pegawai`.`peg_code`
JOIN `m_jabatan` ON `m_pegawai`.`jab_code` = `m_jabatan`.`jab_code`
LEFT JOIN `t_hr_jasa_medis_detail` ON `t_hr_slip_gaji`.`peg_code` = `t_hr_jasa_medis_detail`.`peg_code`
WHERE `t_hr_slip_gaji`.`peg_code` = '001'
AND `t_hr_slip_gaji`.`sg_bukti_date` >= '2024-09-28'
GROUP BY `t_hr_slip_gaji`.`id`
---
    public function getDataByPegawai($peg_code)
    {
        // Hitung tanggal 3 bulan yang lalu
        $threeMonthsAgo = date('Y-m-d', strtotime('-3 months'));

        return $this->select('t_hr_slip_gaji.id as slip_gaji_id, t_hr_slip_gaji.*, m_pegawai.*, m_jabatan.*, MAX(t_hr_jasa_medis_detail.jm_amount) as jasa_medis')
            ->join('m_pegawai', 't_hr_slip_gaji.peg_code = m_pegawai.peg_code')
            ->join('m_jabatan', 'm_pegawai.jab_code = m_jabatan.jab_code')
            ->join('t_hr_jasa_medis_detail', 't_hr_slip_gaji.peg_code = t_hr_jasa_medis_detail.peg_code', 'left') // Gunakan left join jika data di jasa medis opsional
            ->where('t_hr_slip_gaji.peg_code', $peg_code)
            ->where('t_hr_slip_gaji.sg_bukti_date >=', $threeMonthsAgo)
            ->groupBy('t_hr_slip_gaji.id') // Hindari duplikasi data slip gaji
            ->findAll();